{
  "architectures": [
    "CaptchaCRNN"
  ],
  "dtype": "float32",
  "model_type": "captcha_crnn",
  "num_chars": 63,
  "transformers_version": "5.1.0",
  "auto_map": {
    "AutoConfig": "configuration_captcha.CaptchaConfig",
    "AutoModel": "modeling_captcha.CaptchaCRNN",
    "AutoProcessor": "processing_captcha.CaptchaProcessor"
  },
  "custom_pipelines": {
    "captcha-recognition": {
      "impl": "pipeline.CaptchaPipeline",
      "pt": ["AutoModel"],
      "type": "multimodal"
    }
  }
}
